//判断1900-2000内闰年的年份
#include <stdio.h>
int main ()
{
    int t,i=0,a[100];     //定义数组将闰年的年份保存在数组中
    for(t=1900;t<2000;t++)
    {
        if(t%100==0)          //用条件语句进行判断
        if(t%400==0)
        {
            a[i]=t;
            i++;
        }
        else          //此处必须要有一个else与上面if成对
        {                  //避免第二个if与else配对
            i++;           //括号内为无用语句
            i--;
        }
        else                //此处的else与第一个else配对
            if(t%4==0) 
            {
            a[i]=t;
            i++;
            }
    }

    for(t=1;t<=i;t++)
    { 
        printf("%d ",a[t-1]);    //如果t从零开始0与10的余数为零可以使下面的条件语句成立
        if(t%10==0)                  //将使a[0]单独占据一行
        {                          //没隔固定的数字个数此语句将进行分行
            printf("\n"); 
        }
    }
    printf("\n");
    return 0;
}  