// exercise

#include "public.h"
/*
编写程序，从以下 XML 流中提取并显示数据，包括姓名、生日以及账户余额。
<person><name>Karl - Heinz Huber< / name> < dob>1970 - 9 - 30 < / dob > < account>2, 900.64 USD< / account>< / person>。

姓、名要分开显示，生日使用 “日.月.年” 的格式，账户余额忽略小数位。
使用其他 XML 流测试你的程序，如包含多余空白、其他名字、账户余额为负数等等的 XML 流。
*/
void exercise()
{

}

/*
编写程序，使得格式与显示的数据记录如下：
输入 Munich Hamburg 92.12 8:25 9 : 45，这条记录表示从 Munich 到 Hamburg 的航班票价为 92.12 欧元，上午 8 : 25 起飞 9 : 45 到达目的地。
要得到以下输出 Munich->Hamburg      92.12 EUR(08:25 - 09 : 45)。

具体地说，城市名称长度为10并且左对齐而票价长度为7并且右对齐，货币在价格后显示。 
起飞与降落时间一起显示在圆括号中，以连字符分隔，不留空格。对早于10点（上午或下午）的时间，必须在前面补0。 
用不同的数据记录测试你的程序，例如使用长度大于10的城市名。
*/
void exercise1()
{

}