/*找出一个数据序列中最大有序序列的数值个数，记录这个最大有序序列的头坐标（最大有序序列和与求最大的有序序列有序个数相似
这里使用两种方法求最大有序序列的数值个数：①，使用普通的顺序遍历②，使用递归的方法。故不再对最大有序序列和进行求解）
递归方法求解最大有序序列数值个数：可使用二分法从中间开始往两边找，找出最大的有序序列，再二分直到只剩一个数字组成（递归？？？）
*/
/*这里使用简单的逐个遍历的方法。方法较简单不再对其做过多的注释。
*/

#include <stdio.h>
#include <stdlib.h>
#define TU 40     //随机序列大小

int NU[TU] = { 5,1,2,7,4,3,5,1,2,6,9,7,8,4,5,8,2,3,4,5,7,6,4,8,3,5,1,9,2,5,6,9,3,4,5,6,7,2,1,5 };     //随机序列


int main()
{
	int i = 0, ir;
	int max=1, maxi;
	while(i < TU)
	{
		ir = i;
		//printf("%d\n",i);
		while (NU[i] + 1 == NU[i + 1])
		{
			//printf("%d:%d\n",i, NU[i]);
			i++;
			if (i > TU)
				break;
		}
		if (i - ir + 1 > max)
		{
			max = i - ir + 1;
			maxi = ir;
		}
		else
			i++;
	}
	printf("%d,%d\n", max, maxi);

	system("Pause");   //调用DOS命令暂停程序
	return 0;
}